In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.1.0'

In [6]:
df = pd.read_csv('C:\\Users\\admin\\Desktop\\Pramod\\Python_course\\Iris.csv', header=0, index_col=0, skiprows=0)

In [7]:
df

     SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm         Species
Id
1              5.1           3.5            1.4           0.2     Iris-setosa
2              NaN           3.0            1.4           0.2     Iris-setosa
3              4.7           3.2            1.3           0.2     Iris-setosa
4              4.6           3.1            1.5           0.2     Iris-setosa
5              5.0           3.6            1.4           0.2     Iris-setosa
..             ...           ...            ...           ...             ...
146            6.7           3.0            5.2           2.3  Iris-virginica
147            6.3           2.5            5.0           1.9  Iris-virginica
148            6.5           3.0            5.2           2.0  Iris-virginica
149            6.2           3.4            5.4           2.3  Iris-virginica
150            5.9           3.0            5.1           1.8  Iris-virginica

[150 rows x 5 columns]

In [11]:
type(df)

pandas.core.frame.DataFrame

SYNTAX:
    df.head()
    -> Print first 5 entries in dataframe
    
    df.head(10)
    -> Print first 10 entries in dataframe
    
    df.tail()
    -> Print last 5 entries
    
    df.tail(10)
    -> Print last 10 entries

In [22]:
df.head(10)

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa
5   6            5.4           3.9            1.7           0.4  Iris-setosa
6   7            4.6           3.4            1.4           0.3  Iris-setosa
7   8            5.0           3.4            1.5           0.2  Iris-setosa
8   9            4.4           2.9            1.4           0.2  Iris-setosa
9  10            4.9           3.1            1.5           0.1  Iris-setosa

In [24]:
df.tail(8)

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
142,143,5.8,2.7,5.1,1.9,Iris-virginica
143,144,6.8,3.2,5.9,2.3,Iris-virginica
144,145,6.7,3.3,5.7,2.5,Iris-virginica
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 147 entries, 0 to 146
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   3            147 non-null    int64
 1   4.7          147 non-null    float64
 2   3.2          147 non-null    float64
 3   1.3          147 non-null    float64
 4   0.2          147 non-null    float64
 5   Iris-setosa  147 non-null    object
dtypes: float64(4), int64(1), object(1)
memory usage: 7.0+ KB

In [25]:
df.dtypes

SepalLengthCm    float64
SepalWidthCm     float64
PetalLengthCm    float64
PetalWidthCm     float64
Species           object
dtype: object

#### Dataframe is a table representation/organization of data.
- Each column is represented by a *header*.
- Each row is represented by a *index*.
- To identify each data entry is Dataframe, we need corresponding column header and row index values.

<img src='https://pandas.pydata.org/docs/_images/01_table_dataframe.svg'>

In [8]:
df['SepalWidthCm']

Id
1      3.5
2      3.0
3      3.2
4      3.1
5      3.6
      ...
146    3.0
147    2.5
148    3.0
149    3.4
150    3.0
Name: SepalWidthCm, Length: 150, dtype: float64

In [9]:
type(df['SepalWidthCm'])

pandas.core.series.Series

In [15]:
Data = {'Student': ['Pramod', 'Ritwik', 'Aadi'],
       'Maths' : [60, 90, 92],
       'Science': [76, 98, 95]}

student_data = pd.DataFrame(Data)

In [16]:
student_data

  Student  Maths  Science
0  Pramod     60       76
1  Ritwik     90       98
2    Aadi     92       95


### Each column in a dataframe is data series.

<img src='https://pandas.pydata.org/docs/_images/01_table_series.svg'>

In [19]:
student_data['Maths'], type(student_data['Maths'])

(0    60
 1    90
 2    92
 Name: Maths, dtype: int64,
 pandas.core.series.Series)

In [20]:
student_data['Maths'].max()

92

In [21]:
student_data['Maths'].mean()

80.66666666666667

In [22]:
student_data['Maths'].describe()

count     3.000000
mean     80.666667
std      17.925773
min      60.000000
25%      75.000000
50%      90.000000
75%      91.000000
max      92.000000
Name: Maths, dtype: float64

In [24]:
student_data.min()

Student    Aadi
Maths        60
Science      76
dtype: object

### Slicing

In [27]:
student_data

  Student  Maths  Science
0  Pramod     60       76
1  Ritwik     90       98
2    Aadi     92       95

In [34]:
student_data.shape

(3, 3)

##### Using only header based slicing will copy all rows into new DataFrame.

In [28]:
student_data['Maths']

0    60
1    90
2    92
Name: Maths, dtype: int64

In [33]:
df2 = student_data[['Maths', 'Student']]
df2

   Maths Student
0     60  Pramod
1     90  Ritwik
2     92    Aadi

In [35]:
df2.shape

(3, 2)

In [40]:
student_data[student_data['Maths']>=90]

  Student  Maths  Science
1  Ritwik     90       98
2    Aadi     92       95

SYNTAX
##### dataframe.loc[rowind (index), colind (header)]

In [43]:
student_data.loc[student_data['Maths']>=90, 'Student']

1    Ritwik
2      Aadi
Name: Student, dtype: object

In [45]:
student_data

  Student  Maths  Science
0  Pramod     60       76
1  Ritwik     90       98
2    Aadi     92       95

SYNTAX
    dataFrame.iloc[range_of_row_index(s), range_of_col_index(s)]
    
    df.iloc[0, 0] -> select 0th row and 0th column
    df.iloc[:5, 2] -> Select first 5 rows and 2nd column
    df.iloc[2:5, 3:6] -> Select rows from 2 to 4 and columns from 3 to 5
    df.iloc[-1, 3] -> select last row and 3rd column
    df.iloc[:-4, -1] -> Slect all rows from 0 to except last 4 and last column

In [46]:
student_data.iloc[1, 1]

90

In [48]:
student_data.iloc[0:2, :1]

  Student
0  Pramod
1  Ritwik

In [49]:
student_data.iloc[-1, 2]

95

### To file

In [52]:
df3 = student_data[student_data['Maths']>=90]
df3

  Student  Maths  Science
1  Ritwik     90       98
2    Aadi     92       95

SYNTAX
    dataframe.to_csv(filename_with_extension, header=True(default)/False, index=True(default)/False)
    
    -> Prints the data to a CSV file with given file name and heare and index are printed or exlcuded accordingly.

In [56]:
df3.to_csv('Math_topper.csv', header=True, index=False)

In [58]:
df3.to_excel('Math_topper.xlsx', header=True, index=False)

In [60]:
?df3.to_excel